In [2]:
import pandas as pd

In [3]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [4]:
school_series = pd.Series(high_schools)

In [5]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [6]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [7]:
school_df = pd.DataFrame(high_school_dicts)

In [8]:
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [9]:
school_id = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

school_name = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School",
              "Wilson High School", "Cabrera High School", "Bailey High school", "Holden High School", "Pena High School", "Wright High School",
              "Rodgriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

type_of_school = ["District", "District", "Charter", "District", "Charter",
                 "Charter", "Charter", "District", "Charter", "Charter", "Charter",
                 "District", "District", "District", "Charter"]

In [10]:
schools_df = pd.DataFrame()

In [11]:
schools_df["school ID"] = school_id

In [12]:
schools_df

    school ID
0           0
1           1
2           2
3           3
4           4
5           5
6           6
7           7
8           8
9           9
10         10
11         11
12         12
13         13
14         14

In [13]:
schools_df["School Name"] = school_name

In [14]:
schools_df["Type"] = type_of_school

In [15]:
schools_df

    school ID             School Name      Type
0           0       Huang High School  District
1           1    Figueroa High School  District
2           2     Shelton High School   Charter
3           3   Hernandez High School  District
4           4     Griffin High School   Charter
5           5      Wilson High School   Charter
6           6     Cabrera High School   Charter
7           7      Bailey High school  District
8           8      Holden High School   Charter
9           9        Pena High School   Charter
10         10      Wright High School   Charter
11         11  Rodgriguez High School  District
12         12     Johnson High School  District
13         13        Ford High School  District
14         14      Thomas High School   Charter

In [16]:
# creating a dictionary in to python dictionary and then data frame it,

high_schools_dict = {'School ID': school_id, 'School Name': school_name, 'Type': type_of_school}

In [17]:
high_schools_dict

{'School ID': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
 'School Name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School',
  'Wilson High School',
  'Cabrera High School',
  'Bailey High school',
  'Holden High School',
  'Pena High School',
  'Wright High School',
  'Rodgriguez High School',
  'Johnson High School',
  'Ford High School',
  'Thomas High School'],
 'Type': ['District',
  'District',
  'Charter',
  'District',
  'Charter',
  'Charter',
  'Charter',
  'District',
  'Charter',
  'Charter',
  'Charter',
  'District',
  'District',
  'District',
  'Charter']}

In [18]:
# convert the above dict to a data Frame

In [19]:
schools_df

    school ID             School Name      Type
0           0       Huang High School  District
1           1    Figueroa High School  District
2           2     Shelton High School   Charter
3           3   Hernandez High School  District
4           4     Griffin High School   Charter
5           5      Wilson High School   Charter
6           6     Cabrera High School   Charter
7           7      Bailey High school  District
8           8      Holden High School   Charter
9           9        Pena High School   Charter
10         10      Wright High School   Charter
11         11  Rodgriguez High School  District
12         12     Johnson High School  District
13         13        Ford High School  District
14         14      Thomas High School   Charter

In [20]:
# column attribute

schools_df.columns

Index(['school ID', 'School Name', 'Type'], dtype='object')

In [21]:
# Index Attribute

schools_df.index

RangeIndex(start=0, stop=15, step=1)

In [22]:
# Values Attribute - spits out an array of the data with out the headers or columns name

schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter'],
       [5, 'Wilson High School', 'Charter'],
       [6, 'Cabrera High School', 'Charter'],
       [7, 'Bailey High school', 'District'],
       [8, 'Holden High School', 'Charter'],
       [9, 'Pena High School', 'Charter'],
       [10, 'Wright High School', 'Charter'],
       [11, 'Rodgriguez High School', 'District'],
       [12, 'Johnson High School', 'District'],
       [13, 'Ford High School', 'District'],
       [14, 'Thomas High School', 'Charter']], dtype=object)

In [23]:
# Skill Drill 

i = list(range(0,15))

In [24]:
i

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [26]:
series = pd.Series(i)
series

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

In [27]:
series_df = pd.DataFrame()

In [28]:
series_df

Empty DataFrame
Columns: []
Index: []